src/test/resources/xml/valid-message-soap12.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Header />
	<soapenv:Body>
		<test xmlns="http://www.example.org/schema">
			<number>0</number>
			<text>text</text>
		</test>
	</soapenv:Body>
</soapenv:Envelope>
